Ran Plan for project: `prod` dir: `opentofu` workspace: `prod`

<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

OpenTofu will perform the following actions:

  # module.mongodb.mongodbatlas_cluster.cluster["discord-bot"] will be destroyed
  # (because key ["discord-bot"] is not in for_each map)
- resource "mongodbatlas_cluster" "cluster" {
      - auto_scaling_compute_enabled            = false -> null
      - auto_scaling_compute_scale_down_enabled = false -> null
      - backing_provider_name                   = "AZURE" -> null
      - backup_enabled                          = false -> null
      - cloud_backup                            = false -> null
      - cluster_id                              = "65d4b78131917a0c1418cf5c" -> null
      - cluster_type                            = "REPLICASET" -> null
      - connection_strings                      = [
          - {
              - private          = ""
              - private_endpoint = []
              - private_srv      = ""
              - standard         = "mongodb://ac-qoo4yfi-shard-00-00.9jyllsj.mongodb.net:27017,ac-qoo4yfi-shard-00-01.9jyllsj.mongodb.net:27017,ac-qoo4yfi-shard-00-02.9jyllsj.mongodb.net:27017/?ssl=true&authSource=admin&replicaSet=atlas-gpfpam-shard-0"
              - standard_srv     = "mongodb+srv://discord-bot.9jyllsj.mongodb.net"
            },
        ] -> null
      - disk_size_gb                            = 0.5 -> null
      - encryption_at_rest_provider             = "NONE" -> null
      - id                                      = "Y2x1c3Rlcl9pZA==:NjVkNGI3ODEzMTkxN2EwYzE0MThjZjVj-Y2x1c3Rlcl9uYW1l:ZGlzY29yZC1ib3Q=-cHJvamVjdF9pZA==:NjVkNGEzYmYxNjBmNTA0ZjI1NDdjMmNk-cHJvdmlkZXJfbmFtZQ==:VEVOQU5U" -> null
      - mongo_db_major_version                  = "8.0" -> null
      - mongo_db_version                        = "8.0.9" -> null
      - mongo_uri                               = "mongodb://ac-qoo4yfi-shard-00-00.9jyllsj.mongodb.net:27017,ac-qoo4yfi-shard-00-01.9jyllsj.mongodb.net:27017,ac-qoo4yfi-shard-00-02.9jyllsj.mongodb.net:27017" -> null
      - mongo_uri_updated                       = "2024-11-21T11:09:47Z" -> null
      - mongo_uri_with_options                  = "mongodb://ac-qoo4yfi-shard-00-00.9jyllsj.mongodb.net:27017,ac-qoo4yfi-shard-00-01.9jyllsj.mongodb.net:27017,ac-qoo4yfi-shard-00-02.9jyllsj.mongodb.net:27017/?ssl=true&authSource=admin&replicaSet=atlas-gpfpam-shard-0" -> null
      - name                                    = "discord-bot" -> null
      - num_shards                              = 1 -> null
      - paused                                  = false -> null
      - pit_enabled                             = false -> null
      - project_id                              = "65d4a3bf160f504f2547c2cd" -> null
      - provider_instance_size_name             = "M0" -> null
      - provider_name                           = "TENANT" -> null
      - provider_region_name                    = "EUROPE_NORTH" -> null
      - redact_client_log_data                  = false -> null
      - replication_factor                      = 3 -> null
      - snapshot_backup_policy                  = [] -> null
      - srv_address                             = "mongodb+srv://discord-bot.9jyllsj.mongodb.net" -> null
      - state_name                              = "IDLE" -> null
      - termination_protection_enabled          = false -> null
      - version_release_system                  = "LTS" -> null

      - advanced_configuration {
          - change_stream_options_pre_and_post_images_expire_after_seconds = -1 -> null
          - custom_openssl_cipher_config_tls12                             = [] -> null
          - default_max_time_ms                                            = 0 -> null
          - fail_index_key_too_long                                        = false -> null
          - javascript_enabled                                             = true -> null
          - minimum_enabled_tls_protocol                                   = "TLS1_2" -> null
          - no_table_scan                                                  = false -> null
          - oplog_min_retention_hours                                      = 0 -> null
          - oplog_size_mb                                                  = 0 -> null
          - sample_refresh_interval_bi_connector                           = 0 -> null
          - sample_size_bi_connector                                       = 0 -> null
          - tls_cipher_config_mode                                         = "DEFAULT" -> null
          - transaction_lifetime_limit_seconds                             = 0 -> null
        }

      - bi_connector_config {
          - enabled         = false -> null
          - read_preference = "secondary" -> null
        }

      - replication_specs {
          - id         = "65d4b78131917a0c1418cf52" -> null
          - num_shards = 1 -> null
          - zone_name  = "Zone 1" -> null

          - regions_config {
              - analytics_nodes = 0 -> null
              - electable_nodes = 3 -> null
              - priority        = 7 -> null
              - read_only_nodes = 0 -> null
              - region_name     = "EUROPE_NORTH" -> null
            }
        }
    }

  # module.mongodb.mongodbatlas_cluster.cluster["kotbot-bot"] will be created
+ resource "mongodbatlas_cluster" "cluster" {
      + accept_data_risks_and_force_replica_set_reconfig = (known after apply)
      + auto_scaling_compute_enabled                     = (known after apply)
      + auto_scaling_compute_scale_down_enabled          = (known after apply)
      + auto_scaling_disk_gb_enabled                     = (known after apply)
      + backing_provider_name                            = "AZURE"
      + backup_enabled                                   = (known after apply)
      + cloud_backup                                     = false
      + cluster_id                                       = (known after apply)
      + cluster_type                                     = "REPLICASET"
      + connection_strings                               = (known after apply)
      + container_id                                     = (known after apply)
      + disk_size_gb                                     = (known after apply)
      + encryption_at_rest_provider                      = (known after apply)
      + id                                               = (known after apply)
      + mongo_db_major_version                           = (known after apply)
      + mongo_db_version                                 = (known after apply)
      + mongo_uri                                        = (known after apply)
      + mongo_uri_updated                                = (known after apply)
      + mongo_uri_with_options                           = (known after apply)
      + name                                             = "kotbot-bot"
      + num_shards                                       = (known after apply)
      + paused                                           = (known after apply)
      + pit_enabled                                      = (known after apply)
      + project_id                                       = "65d4a3bf160f504f2547c2cd"
      + provider_auto_scaling_compute_max_instance_size  = (known after apply)
      + provider_auto_scaling_compute_min_instance_size  = (known after apply)
      + provider_disk_iops                               = (known after apply)
      + provider_disk_type_name                          = (known after apply)
      + provider_encrypt_ebs_volume                      = (known after apply)
      + provider_encrypt_ebs_volume_flag                 = (known after apply)
      + provider_instance_size_name                      = "M0"
      + provider_name                                    = "TENANT"
      + provider_region_name                             = "EUROPE_NORTH"
      + provider_volume_type                             = (known after apply)
      + redact_client_log_data                           = (known after apply)
      + replication_factor                               = (known after apply)
      + snapshot_backup_policy                           = (known after apply)
      + srv_address                                      = (known after apply)
      + state_name                                       = (known after apply)
      + termination_protection_enabled                   = (known after apply)
      + version_release_system                           = (known after apply)

      + advanced_configuration (known after apply)

      + bi_connector_config (known after apply)

      + replication_specs (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=opentoucan%252Finfrastructure-config%252Fopentofu%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```